
PRIVATE @АктуальныеИтоги datetime = '3999-11-01T00:00:00'
PRIVATE @Результат       object
PRIVATE @Таблица         array

SET @Результат.НачалоГода     = DATESTART('YEAR',    '2026-03-01T12:34:56')
SET @Результат.НачалоКвартала = DATESTART('QUARTER', '2026-05-01T12:34:56')
SET @Результат.НачалоМесяца   = DATESTART('MONTH',   '2026-03-05T12:34:56')
SET @Результат.НачалоДня      = DATESTART('DAY',     '2026-03-01T12:34:56')
SET @Результат.НачалоЧаса     = DATESTART('HOUR',    '2026-03-01T12:34:56')
SET @Результат.НачалоМинуты   = DATESTART('MINUTE',  '2026-03-01T12:34:56')

SET @Результат.КонецГода     = DATEEND('YEAR',    '2026-03-01T12:34:56')
SET @Результат.КонецКвартала = DATEEND('QUARTER', '2026-05-01T12:34:56')
SET @Результат.КонецМесяца   = DATEEND('MONTH',   '2026-03-05T12:34:56')
SET @Результат.КонецДня      = DATEEND('DAY',     '2026-03-01T12:34:56')
SET @Результат.КонецЧаса     = DATEEND('HOUR',    '2026-03-01T12:34:56')
SET @Результат.КонецМинуты   = DATEEND('MINUTE',  '2026-03-01T12:34:56')

SET @Результат.ПлюсГод     = DATEADD('YEAR',    1, '2026-01-01T00:00:00')
SET @Результат.ПлюсКвартал = DATEADD('QUARTER', 1, '2026-01-01T00:00:00')
SET @Результат.ПлюсМесяц   = DATEADD('MONTH',   1, '2026-01-01T00:00:00')
SET @Результат.ПлюсДень    = DATEADD('DAY',     1, '2026-01-01T00:00:00')
SET @Результат.ПлюсЧас     = DATEADD('HOUR',    1, '2026-01-01T00:00:00')
SET @Результат.ПлюсМинута  = DATEADD('MINUTE',  1, '2026-01-01T00:00:00')
SET @Результат.ПлюсСекунда = DATEADD('SECOND',  1, '2026-01-01T00:00:00')

SET @Результат.МинусГод     = DATEADD('YEAR',    -1, '2026-01-01T00:00:00')
SET @Результат.МинусКвартал = DATEADD('QUARTER', -1, '2026-01-01T00:00:00')
SET @Результат.МинусМесяц   = DATEADD('MONTH',   -1, '2026-01-01T00:00:00')
SET @Результат.МинусДень    = DATEADD('DAY',     -1, '2026-01-01T00:00:00')
SET @Результат.МинусЧас     = DATEADD('HOUR',    -1, '2026-01-01T00:00:00')
SET @Результат.МинусМинута  = DATEADD('MINUTE',  -1, '2026-01-01T00:00:00')
SET @Результат.МинусСекунда = DATEADD('SECOND',  -1, '2026-01-01T00:00:00')

RETURN @Результат