
PRIVATE @Таблица array
PRIVATE @Ссылка entity = {56:b188f799-2c11-1b8f-11f1-96564be2c9e5}

USE 'MS_TEST'
  
  SELECT Период, Регистратор
       , ВидДвижения = CASE WHEN ВидДвижения = 0 THEN 'Приход' ELSE 'Расход' END
       , Номенклатура, Количество
    INTO @Таблица
    FROM РегистрНакопления.ОстаткиТовара AS Остатки
   INNER JOIN Документ.Приход            AS Документ
      ON Регистратор = Документ.Ссылка
   WHERE Документ.Номер = '000001'
     AND Дата BETWEEN '2026-01-01T00:00:00' AND '2026-12-31T23:59:59'
     AND Регистратор = {56:b188f799-2c11-1b8f-11f1-96564be2c9e5}
     AND Регистратор = @Ссылка

END

RETURN @Таблица