
PRIVATE @Таблица array

USE 'MS_TEST'

  WITH Вид AS
  (
    SELECT Товар = Перечисление.ВидНоменклатуры.Товар
         , Услуга = Перечисление.ВидНоменклатуры.Услуга
  )
  SELECT Номенклатура, Партия, Количество, Признак
       , ВидДвижения = CASE WHEN ВидДвижения = 0 THEN 'Приход' ELSE 'Расход' END
    INTO @Таблица
    FROM РегистрНакопления.ОстаткиТовара AS Остатки
   INNER JOIN Вид ON Остатки.Признак = Вид.Товар
   WHERE NOT Партия IS Перечисление.ВидНоменклатуры
   ORDER BY Количество DESC
END

RETURN @Таблица