
PRIVATE @Таблица array

DECLARE @НачалоПериода datetime  = '2026-06-01T00:00:00'
DECLARE @КонецПериода  datetime  = '2026-06-30T23:59:59'

USE 'MS_TEST'

  SELECT Номенклатура, Партия, Количество, Признак
       , ВидДвижения = CASE WHEN ВидДвижения = 0 THEN 'Приход' ELSE 'Расход' END
    INTO @Таблица
    FROM РегистрНакопления.ОстаткиТовара
   WHERE Период BETWEEN @НачалоПериода AND @КонецПериода
     AND NOT Партия IS Перечисление.ВидНоменклатуры
     AND Признак = Перечисление.ВидНоменклатуры.Товар
   ORDER BY Количество DESC

END

RETURN @Таблица